In [1]:
import pandas as pd 
miss=['n/a','na','--']
df=pd.read_csv('https://raw.githubusercontent.com/dataoptimal/posts/master/data%20cleaning%20with%20python%20and%20pandas/property%20data.csv',na_values=miss)

In [2]:
import numpy as np
df['OWN_OCCUPIED']=df['OWN_OCCUPIED'].replace(r'[0-9]+',np.nan,regex=True)
df.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0     PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0  LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN  LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0   BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0   BERKELEY            Y           3.0        2  1600.0

In [3]:
df.isnull().sum()

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    3
NUM_BATH        1
SQ_FT           2
dtype: int64

In [4]:
import numpy as np
df['NUM_BATH']=df['NUM_BATH'].replace(r'[A-Z]+',np.nan,regex=True)
df.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0     PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0  LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN  LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0   BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0   BERKELEY            Y           3.0        2  1600.0

In [5]:
df.isnull()

     PID  ST_NUM  ST_NAME  OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False   False    False         False         False     False  False
1  False   False    False         False         False     False   True
2  False    True    False         False          True     False  False
3  False   False    False          True         False      True  False
4   True   False    False         False         False     False  False
5  False   False    False         False          True     False  False
6  False    True    False          True         False      True  False
7  False   False    False         False         False     False   True
8  False   False    False         False          True     False  False

In [6]:
df.isnull().sum().sum()

12

In [7]:
df.fillna(0)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     0.0
2  100003000.0     0.0   LEXINGTON            N           0.0        1   850.0
3  100004000.0   201.0    BERKELEY            0           1.0        0   700.0
4          0.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           0.0        1   800.0
6  100007000.0     0.0  WASHINGTON            0           2.0        0   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     0.0
8  100009000.0   215.0     TREMONT            Y           0.0        2  1800.0

In [8]:
df.fillna(method ='bfill')

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5   850.0
2  100003000.0   201.0   LEXINGTON            N           1.0        1   850.0
3  100004000.0   201.0    BERKELEY            Y           1.0        2   700.0
4  100006000.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           2.0        1   800.0
6  100007000.0   213.0  WASHINGTON            Y           2.0        1   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1  1800.0
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [9]:
df.fillna('ffill')

           PID ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH  SQ_FT
0  1.00001e+08    104      PUTNAM            Y            3        1   1000
1  1.00002e+08    197   LEXINGTON            N            3      1.5  ffill
2  1.00003e+08  ffill   LEXINGTON            N        ffill        1    850
3  1.00004e+08    201    BERKELEY        ffill            1    ffill    700
4        ffill    203    BERKELEY            Y            3        2   1600
5  1.00006e+08    207    BERKELEY            Y        ffill        1    800
6  1.00007e+08  ffill  WASHINGTON        ffill            2    ffill    950
7  1.00008e+08    213     TREMONT            Y            1        1  ffill
8  1.00009e+08    215     TREMONT            Y        ffill        2   1800

In [10]:
df.replace(np.nan,-99)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5   -99.0
2  100003000.0   -99.0   LEXINGTON            N         -99.0        1   850.0
3  100004000.0   201.0    BERKELEY          -99           1.0      -99   700.0
4        -99.0   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y         -99.0        1   800.0
6  100007000.0   -99.0  WASHINGTON          -99           2.0      -99   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1   -99.0
8  100009000.0   215.0     TREMONT            Y         -99.0        2  1800.0

In [11]:
df.dropna()# rows without any NaN

           PID  ST_NUM ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0  PUTNAM            Y           3.0        1  1000.0

In [12]:
df.dropna(how='all')#

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0      NaN   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [13]:
df.dropna(axis=1)

      ST_NAME
0      PUTNAM
1   LEXINGTON
2   LEXINGTON
3    BERKELEY
4    BERKELEY
5    BERKELEY
6  WASHINGTON
7     TREMONT
8     TREMONT

In [14]:
df.dropna(axis=1,how='all')

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0      NaN   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [15]:
data=pd.read_csv('https://gist.githubusercontent.com/ktisha/c21e73a1bd1700294ef790c56c8aec1f/raw/819b69b5736821ccee93d05b51de0510bea00294/pima-indians-diabetes.csv',skiprows=10,header=None)
data.head(5)

   0    1   2   3    4     5      6   7  8
0  1   85  66  29    0  26.6  0.351  31  0
1  8  183  64   0    0  23.3  0.672  32  1
2  1   89  66  23   94  28.1  0.167  21  0
3  0  137  40  35  168  43.1  2.288  33  1
4  5  116  74   0    0  25.6  0.201  30  0

In [16]:
data[[1,2,3,4,5]]=data[[1,2,3,4,5]].replace(0,np.nan)
data

      0      1     2     3      4     5      6   7  8
0     1   85.0  66.0  29.0    NaN  26.6  0.351  31  0
1     8  183.0  64.0   NaN    NaN  23.3  0.672  32  1
2     1   89.0  66.0  23.0   94.0  28.1  0.167  21  0
3     0  137.0  40.0  35.0  168.0  43.1  2.288  33  1
4     5  116.0  74.0   NaN    NaN  25.6  0.201  30  0
..   ..    ...   ...   ...    ...   ...    ...  .. ..
762  10  101.0  76.0  48.0  180.0  32.9  0.171  63  0
763   2  122.0  70.0  27.0    NaN  36.8  0.340  27  0
764   5  121.0  72.0  23.0  112.0  26.2  0.245  30  0
765   1  126.0  60.0   NaN    NaN  30.1  0.349  47  1
766   1   93.0  70.0  31.0    NaN  30.4  0.315  23  0

[767 rows x 9 columns]

In [17]:
data.fillna(data.mean(),inplace=True)
data

      0      1     2          3           4     5      6   7  8
0     1   85.0  66.0  29.000000  155.548223  26.6  0.351  31  0
1     8  183.0  64.0  29.142593  155.548223  23.3  0.672  32  1
2     1   89.0  66.0  23.000000   94.000000  28.1  0.167  21  0
3     0  137.0  40.0  35.000000  168.000000  43.1  2.288  33  1
4     5  116.0  74.0  29.142593  155.548223  25.6  0.201  30  0
..   ..    ...   ...        ...         ...   ...    ...  .. ..
762  10  101.0  76.0  48.000000  180.000000  32.9  0.171  63  0
763   2  122.0  70.0  27.000000  155.548223  36.8  0.340  27  0
764   5  121.0  72.0  23.000000  112.000000  26.2  0.245  30  0
765   1  126.0  60.0  29.142593  155.548223  30.1  0.349  47  1
766   1   93.0  70.0  31.000000  155.548223  30.4  0.315  23  0

[767 rows x 9 columns]

In [18]:
data.describe()

,0,1,2,3,4,5,6,7,8
count,767.000000,767.000000,767.000000,767.000000,767.000000,767.000000,767.000000,767.000000,767.000000
mean,3.842243,121.652231,72.405738,29.142593,155.548223,32.455952,0.471674,33.219035,0.348110
std,3.370877,30.440947,12.104231,8.794137,85.076586,6.879514,0.331497,11.752296,0.476682
min,0.000000,44.000000,24.000000,7.000000,14.000000,18.200000,0.078000,21.000000,0.000000
25%,1.000000,99.500000,64.000000,25.000000,121.000000,27.500000,0.243500,24.000000,0.000000
50%,3.000000,117.000000,72.405738,29.142593,155.548223,32.400000,0.371000,29.000000,0.000000
75%,6.000000,140.000000,80.000000,32.000000,155.548223,36.600000,0.625000,41.000000,1.000000
max,17.000000,199.000000,122.000000,99.000000,846.000000,67.100000,2.420000,81.000000,1.000000